<?php
return [
    'messages' => [
        'success' => 'تمت العملية بنجاح',
        'updated' => 'تم التعديل بنجاح',
        'created' => 'تمت الاضافة بنجاح',
        'deleted' => 'تم الحذف بنجاح',
        'error' => 'فشلت العملية'
    ],
    'cities' => [
        'failed' => 'فشل حذف المدينة المطلوبة لانها تحتوي عل احياء'
    ],
    'categories' => [
        'failed' => 'فشل حذف القسم المطلوب لانه يحتوي عل منتجات'
    ],
    'regions' => [
        'failed' => 'فشل حذف المنطقة المطلوبة لانها تنتمي الى عنواين مستخدمين'
    ]
];
