<?php
return [
    'messages' => [
        'success' => 'تمت العملية بنجاح',
        'updated' => 'تم التعديل بنجاح',
        'created' => 'تمت الاضافة بنجاح',
        'deleted' => 'تم الحذف بنجاح',
        'error' => 'فشلت العملية',
        'orderCreated' => 'لقد تم تسليم طلبكم بنجاح'
    ],
    'cities' => [
        'failed' => 'فشل حذف المدينة المطلوبة لانها تحتوي عل احياء'
    ],
    'categories' => [
        'failed' => 'فشل حذف القسم المطلوب لانه يحتوي عل منتجات'
    ],
    'regions' => [
        'failed' => 'فشل حذف المنطقة المطلوبة لانها تنتمي الى عنواين مستخدمين'
    ],
    'coupons' => [
        'failed' => 'فشل حذف الكوبون المطلوب لانه ينتمي الى طلب ما'
    ],
    'errors' => [
        'region_id_required' => 'يجب ادخال حقل الحي.',
        'region_id_integer' => 'حقل الحي غير صحيح.',
        'region_id_exists' => '.الحي غير موجود',
    ]
];
