<?php
return [
    /*
    |--------------------------------------------------------------------------
    | Messages Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for user pages regular phrases for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'auth' => [
        'login' => [
            'email' => 'الايميل',
            'login_title' => 'تسجيل الدخول',
            'password' => 'رمز المرور',
            'remember_me' => 'تذكرني',
            'login' => 'تسجيل الدخول',
            'forgot_password' => 'هل نسيت كلمة المرور ؟',
            'message' => 'نسيت كلمة السر؟ لا مشكلة. ما عليك سوى إخبارنا بعنوان بريدك الإلكتروني وسنرسل إليك عبر البريد الإلكتروني رابطًا لإعادة تعيين كلمة المرور سيسمح لك باختيار عنوان جديد.',
            'send_password_email_reset' => 'ارسال رابط تغيير كلمة المرور',
            'confirm_password' => 'تأكيد كلمة المرور',
            'reset_password' => 'أعد تعييين كلمة المرور',
            'or' => '- أو -',
            'login_google' => 'تسجيل الدخول باستخدام جوجل',
            'login_facebook' => 'تسجيل الدخول باستخدام فيسبوك',
            'register' => 'حساب جديد',
            'logout' => 'تسجيل الخروج',
        ],
        'register' => [
            'email' => 'الايميل',
            'password' => 'رمز المرور',
            'register_title' => 'تسجيل عضوية جديدة',
            'full_name' => 'ألأسم بالكامل',
            'shop_name' => 'اسم المحل',
            'phone_number' => 'رقم الهاتف',
            'agree' => 'موافق علي ',
            'terms' => 'الشروط',
            'registered' => 'لديك حساب بالفعل ؟',
            'register' => 'حساب جديد',
            'confirm_password' => 'تأكيد كلمة المرور',
        ],
        'verify_email' => [
            'title' => 'تأكيد البريد الالكتروني',
            'verify_email_head' => 'شكرا لتسجيلك! قبل البدء ، هل يمكنك التحقق من عنوان بريدك الإلكتروني من خلال النقر على الرابط الذي أرسلناه إليك عبر البريد الإلكتروني للتو؟ إذا لم تتلق البريد الإلكتروني ، فسنرسل لك بريدًا إلكترونيًا بكل سرور',
            'verify_email_confrmation' => 'تم إرسال رابط تحقق جديد إلى عنوان البريد الإلكتروني الذي قدمته أثناء التسجيل',
            'confirm' => 'أكد',
            'logout' => 'تسجيل الخروج',
            'email' => 'الايميل',
        ],
        'forgot_password' => [
            'email' => 'الايميل',
            'title' => 'نسيت كلمة السر',
            'message' => 'نسيت كلمة السر؟ لا مشكلة. ما عليك سوى إخبارنا بعنوان بريدك الإلكتروني وسنرسل إليك عبر البريد الإلكتروني رابطًا لإعادة تعيين كلمة المرور سيسمح لك باختيار عنوان جديد.',
            'send_password_email_reset' => 'ارسال رابط تغيير كلمة المرور',
        ],
        'confirm_password' => [
            'page_title' => 'تأكيد كلمة المرور',
            'confirm_password_title' => 'هذه منطقة آمنة للتطبيق. يرجى تأكيد كلمة المرور الخاصة بك قبل المتابعة',
            'message' => 'نسيت كلمة السر؟ لا مشكلة. ما عليك سوى إخبارنا بعنوان بريدك الإلكتروني وسنرسل إليك عبر البريد الإلكتروني رابطًا لإعادة تعيين كلمة المرور سيسمح لك باختيار عنوان جديد.',
            'confirm' => 'تأكيد',

        ],
        'reset_password' => [
            'page_title' => 'إعادة تعيين كلمة المرور',
            'password' => 'رمز المرور',
            'confirm_password' => 'تأكيد كلمة المرور',
        ],


    ],
    'profile' => [
        'profile' => 'حساب تعريفي',
        'update_info' => [
            'profile_info' => 'معلومات الحساب',
            'message' => "قم بتحديث معلومات الملف الشخصي لحسابك وعنوان البريد الإلكتروني ",
            'name' => 'الأسم',
            'email' => 'الايميل',
            'resend_verification_mail' => 'أعد ارسال البريد الالكروني',
            'verification_message' => 'تم إرسال رابط تحقق جديد إلى عنوان بريدك الإلكتروني',
            'saved' => 'تم الحفظ',
            'save' => 'أحفظ',
        ],
        'update_password' => [
            'update_password' => 'تحديث كلمة المرور',
            'update_password_message' => 'تأكد من أن حسابك يستخدم كلمة مرور طويلة وعشوائية للبقاء آمنًا',
            'current_password' => 'كلمة المرور الحالبة',
            'new_password' => 'كلمة المرور الجديدة',
            'confirm_password' => 'تأكيد كلمة المرور',
        ],
        'delete_account' => [
            'delete_message' => 'بمجرد حذف حسابك ، سيتم حذف جميع موارده وبياناته نهائيًا. قبل حذف حسابك ، يرجى تنزيل أي بيانات أو معلومات ترغب في الاحتفاظ بها',
            'delete' => 'حذف الحساب',
            'current_password'=>'كلمه السر الحاليه',
            'new_password'=>'كلمه السر الجديده',
            'confirm_password'=>'تاكيد كلمه السر',
            'email_unverified'=>'البريد الشخصي غير موثق.'
        ],

    ],
    'header' => [
        'dashboard' => 'لوحة التحكم',
        'free_shipping' => 'شحن مجاني للطلبات التي تزيد عن 100 دولار',
        'faq' => 'المساعدة والأسئلة الشائعة',
        'lang' => ' ع ',
        'currency' => 'الدولار',
        'home' => 'الرئيسية',
        'shop' => 'المتجر',
        'blog' => 'المدونة',
        'about' => 'أعرف عنا',
        'contact' => 'تواصل معنا',
        'seller_account' => 'قم بالبيع معنا',
        'login' => 'تسجيل الدخول',
        'logout' => 'تسجيل الخروج',
        'register' => 'حساب جديد',
        'addresses' => 'عنوانيني',

    ],
    'footer' => [
        'categories' => 'الاقسام',
        'help' => 'المساعدة',
        'track_order' => 'تتبع الطلب',
        'returns' => 'المردودات',
        'shipping' => 'الشحن',
        'faqs' => 'الآسئلة المتكررة',
        'get_in_touch' => 'ابقى على تواصل',
        'more_questions' => 'أي أسئلة؟ أخبرنا بالمتجر في الطابق الثامن ، 379 شارع هدسون ، نيويورك ، نيويورك 10018 أو اتصل بنا على',
        'newsletter' => 'النشرة الإخبارية',
        'subscribe' => 'اشتراك'
    ],

    'index' => [
        'message' => 'تريد أن تصبح بائع في موقعنا',
        'have_account' => 'لديك بالفعل حساب بائع',
        'dont_have_account' => 'ليس لديك حساب',
    ],
    'shared' => [
        'currency' => 'جنيه'
    ]

];
