<?php
return [

    /*
    |--------------------------------------------------------------------------
    | Messages Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during regular phrases for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'auth' => [
        'reset' => 'تمت إعادة تعيين كلمة المرور',
        'sent' => 'تم إرسال تفاصيل استعادة كلمة المرور الخاصة بك إلى بريدك الإلكتروني',
        'throttled' => 'الرجاء الانتظار قبل إعادة المحاولة',
        'token' => 'رمز استعادة كلمة المرور هذا غير صالح',
        'user' => "لم يتم العثور على أيّ حسابٍ بهذا العنوان الإلكتروني",
        'email_placeholder'=>"بريدك الالكتروني",
        'your'=>"الشخصي , :Name",
        'email' => 'البريد الالكتروني',
        'login_title' => 'تسجيل الدخول',
        'password' => 'رمز المرور',
        'remember_me' => 'تذكرني',
        'log_in' => 'تسجيل الدخول',
        'forgot_password' => 'هل نسيت كلمة المرور ؟',
        'forgot' => 'نسيت كلمه المرور',
        'forgot_password_title' => 'نسيت كلمة السر؟ لا مشكلة. ما عليك سوى إخبارنا بعنوان بريدك الإلكتروني وسنرسل إليك عبر البريد الإلكتروني رابطًا لإعادة تعيين كلمة المرور سيسمح لك باختيار عنوان جديد.',
        'send_password_email_reset' => 'ارسال رابط تغيير كلمة المرور',
        'confirm_password' => 'تأكيد كلمة المرور',
        'reset_password' => 'أعد تعييين كلمة المرور',
        'or' => '- أو -',
        'login_google' => 'تسجيل الدخول باستخدام جوجل',
        'login_facebook' => 'تسجيل الدخول باستخدام فيسبوك',
        'register' => 'حساب جديد',
        'register_title' => 'تسجيل عضوية جديدة',
        'full_name' => 'ألأسم بالكامل',
        'shop_name' => 'اسم المحل',
        'phone_number' => 'رقم الهاتف',
        'agree' => 'موافق علي ',
        'terms' => 'الشروط',
        'registered' => 'لديك حساب بالفعل ؟',
        'verify_email' => 'التحقق من البريد الالكتروني',
        'verify_email_head' => 'شكرا لتسجيلك! قبل البدء ، هل يمكنك التحقق من عنوان بريدك الإلكتروني من خلال النقر على الرابط الذي أرسلناه إليك عبر البريد الإلكتروني للتو؟ إذا لم تتلق البريد الإلكتروني ، فسنرسل لك بريدًا إلكترونيًا بكل سرور',
        'verify_email_confrmation' => 'تم إرسال رابط تحقق جديد إلى عنوان البريد الإلكتروني الذي قدمته أثناء التسجيل',
        'confirm' => 'أكد',
        'logout' => 'تسجيل الخروج',
        'confirm_password_title' => 'هذه منطقة آمنة للتطبيق. يرجى تأكيد كلمة المرور الخاصة بك قبل المتابعة',
        'confirm_password' => 'تاكيد كلمه المرور',
    ],
    'profile' => [
        'profile_info' => 'معلومات الحساب',
        'message' => "قم بتحديث معلومات الملف الشخصي لحسابك وعنوان البريد الإلكتروني ",
        'name' => 'الأسم',
        'email' => 'البريد الالكتروني',
        'resend_verification_mail' => 'أعد ارسال البريد الالكروني',
        'verification_message' => 'تم إرسال رابط تحقق جديد إلى عنوان بريدك الإلكتروني',
        'saved' => 'تم الحفظ',
        'save' => 'أحفظ',
        'update_password' => 'تحديث كلمة المرور',
        'update_password_message' => 'تأكد من أن حسابك يستخدم كلمة مرور طويلة وعشوائية للبقاء آمنًا',
        'current_password' => 'كلمة المرور الحالبة',
        'new_password' => 'كلمة المرور الجديدة',
        'confirm_password' => 'تأكيد كلمة المرور',
        'delete_message' => 'بمجرد حذف حسابك ، سيتم حذف جميع موارده وبياناته نهائيًا. قبل حذف حسابك ، يرجى تنزيل أي بيانات أو معلومات ترغب في الاحتفاظ بها',
        'delete' => 'حذف الحساب',
        'profile' => 'حساب تعريفي',
        'delete_confirm' =>'هل انت متاكد من مسح الخساب ؟',
        'cancel' => 'الغاء',
        'edit_profile' => 'تعديل الحساب الشخصي'
    ],
    'header' => [
        'search' => 'ابحث .....',
        'dashboard' => 'لوحة التحكم',
        'free_shipping' => 'شحن مجاني للطلبات التي تزيد عن 100 دولار',
        'faq' => 'المساعدة والأسئلة الشائعة',
        'lang' => ' ع ',
        'currency' => 'الدولار',
        'home' => 'الرئيسية',
        'shop' => 'المتجر',
        'blog' => 'المدونة',
        'about' => 'أعرف عنا',
        'contact' => 'تواصل معنا',
        'seller_account' => 'حساب البائع الخاص بك',
    ],
    'footer' => [
        'categories' => 'الاقسام',
        'help' => 'المساعدة',
        'track_order' => 'تتبع الطلب',
        'returns' => 'المردودات',
        'shipping' => 'الشحن',
        'faqs' => 'الآسئلة المتكررة',
        'get_in_touch' => 'ابقى على تواصل',
        'more_questions' => 'أي أسئلة؟ أخبرنا بالمتجر في الطابق الثامن ، 379 شارع هدسون ، نيويورك ، نيويورك 10018 أو اتصل بنا على',
        'newsletter' => 'النشرة الإخبارية',
        'subscribe' => 'اشتراك'
    ],
    'cart' => [
        'your_cart' => 'عربة التسوق الخاصة بك',
        'total' => 'إجمالي :',
        'view_cart' => 'عرض عربة التسوق',
        'checkout' => 'الدفع',
        'product' => 'المنتج',
        'price' => 'السعر',
        'quantity' => 'الكمية',
        'total' => 'الإجمالي الكلي',
        'coupon_code' => 'كود الكوبون',
        'apply_coupon' => 'تطبيق الكوبون',
        'update_cart' => 'تحديث عربة التسوق',
        'cart_total' => 'اجمالي عربة التسوق',
        'subtotal' => 'المجموع الفرعي:',
        'shipping' => 'الشحن:',
        'calc_shipping' => 'احسب الشحن',
        'select_country' => 'اختر دولة...',
        'state_country' => 'ولايه/ دوله',
        'postcode' => 'الرمز البريدي',
        'update_total' => 'تحديث الإجمالي',
        'proceed' => 'النتابعة للدفع',
    ],
    'index' => [
        'message' => 'تريد أن تصبح بائع في موقعنا',
        'have_account' => 'لديك بالفعل حساب بائع',
        'dont_have_account' => 'ليس لديك حساب',
    ],
    'shared' => [
        'currency' => 'جنيه'
    ]
];

