app/Http/Controllers/Seller/ProductsController.php

select * from `categories` where `categories`.`id` in (1)
select * from `products` where `seller_id` = 1
---
    public function index()
    {

        $products = Product::with('category')->where('seller_id', Auth::guard('seller')->id())->get();

select * from `categories` where `categories`.`id` in (1)
---
    public function show(Product $product, SpecService $specService, ReviewService $reviewService, string $slug = null)
    {
        $product->load('category');

delete from `media` where `id` = 30
delete from `products` where `id` = 37
update `products` set `name` = '{\"ar\":\"aa updated\",\"en\":\"new laptop updated\"}', `sale_price` = '120', `purchase_price` = '100', `quantity` = '10', `description` = '{\"ar\":\"aa updated\",\"en\":\"ddd updated\"}', `status` = '1', `slug` = '{\"en\":\"new-laptop-updated\",\"ar\":\"aa-updated\"}', `products`.`updated_at` = '2023-03-24 07:57:53' where `id` = 35
---
    public function update(UpdateProductRequest $request, Product $product)
    {
        if($request->has('image')){
            $media = $product->getFirstMedia('product');
            $media->delete();
            $product->addMediaFromRequest('image')->toMediaCollection('product');
        }
        $product->update($request->validated());