app/Http/Controllers/Seller/ProductsController.php

select `id`, `name` from `categories` where `status` = 1
---
    public function create()
    {
        $categories = Category::select(['id', 'name'])->where('status', CategoryEnum::ACTIVE->value)->get();